app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "Trial post!"], ["created_at", "2020-05-11 14:14:44.506625"], ["updated_at", "2020-05-11 14:14:44.506625"], ["user_id", 3]]